// 1) • ჩამოწერეთ მნიშვნელობები, რომლებიც Truthy მნიშვნელობას ეკუთვნის.
//    • ჩამოწერეთ მნიშვნელობები, რომლებიც Falsey მნიშვნელობას ეკუთვნის.


// Truthy-ს ეკუთვნის 1 და "" - ში სავსე მნიშვნელობები ხოლო  Falsey- ის ეკუთვნის 0 და ""-ის ცარიელი მნიშვნელობები


// 2) მომხმარებელს prompt()-ის გამოყენებით შემოატანინეთ ინფორმაცია არის თუ არა ადმინი. თუ მომხმარებელი შემოიტანს 'yes' მაშინ isAdmin ცვლადში შეინახეთ true, თუ შემოიტანს 'no', მაშინ isAdmin ცვლადში შეინახეთ false. გამოიყენეთ Ternary operator-ი.


let answer = prompt("Are you admin?")

if (answer === "yes") {
    let isAdmin = true
} else {
    let isAdmin = false
}