

# 2) დაწერეთ ფუნქცია, რომელიც მიიღებს მომხმარებლის სახელს. გვარსა და ასაკს. ფუნქციამ დააბრუნოს მომხმარებლის მონაცემები f სტრინგის გამოყენებით.


user = lambda name,surname,age:f"name {name}, surname {surname}, age {age}"

print(user("luka ", "laghoshvili ", 17))


# 3) დაწერეთ ფუნქცია, რომელიც გამოითვლის რიცხვების სიის საშუალო არითმეტიკულს
average = lambda number: sum(number) / len(number)

print(average([20,30,490,59,234,654,8563,2345,7]))




# 4) დაწერეთ ფუნქცია, რომელსაც გადაეცემა სტრინგი. პასუხად დააბრუნეთ არის თუ არა იგი პალინდრომი. (მოიძიეთ თუ რას ნიშნავს Palindrome).

# ??????????????????????






# 5) დაწერეთ ფუნქცია, რომელიც აბრუნებს:
# • 'Positive' თუ რიცხვი დადებითია.
# • 'Negative' თუ რიცხვი უარყოფითი.
# • 'Zero' თუ რიცხვი ნულია. 
# გამოიყენეთ Ternary ოპერატორი.



check_number = lambda x: "Positive" if x > 0 else "Negative" if x  < 0 else "Zero"


print(check_number(-1))
print(check_number(0))
print(check_number(1))





# 6) დაწერეთ ფუნქცია, რომელიც არგუმენტად მიიღებს სიას. პასუხად დააბრუნოს სიის თითოეული რიცხვი გამრავლებული 2-ზე.


number_times = lambda numbers: [x * 2 for x in numbers]

print(number_times([20,30,40,50]))



# 7) გამოიყენეთ List comprehension და Lambda მოცემული პროგრამის დასაწერად:
# დაწერეთ ფუნქცია, რომელსაც გადასცემთ სტრინგების სიას. ფუნქციამ უნდა დააბრუნოს მხოლოდ ისეთი სტრინგები, რომელთა სიგრძეც 5-ს აღემატება.

# ???????



# 8)

